1c_um/src/InformationRegisters/ум_ПакетыДанных/ум_ПакетыДанных.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ум_ПакетыДанных</name>
  <resources>
    <name>ВременнаяМеткаСоздания</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>КлючАналитикиПакетаДанных</name>
    <type>
      <types>CatalogRef.ум_КлючиАналитикиПакетовДанных</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСозданияПакета</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОбработкиПакета</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСледующейОбработкиПакета</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДлительностьОбработки</name>
    <comment>Длительность обработки</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КлючРабочегоПотока</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоПопытокОбработки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПакетПрипаркован</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДополнительнаяИнформация</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>256</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>ИдентификаторПакета</name>
    <type>
      <types>UUID</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

1c_um/src/InformationRegisters/ум_ЖурналСобытийПакетовДанных/ум_ЖурналСобытийПакетовДанных.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ум_ЖурналСобытийПакетовДанных</name>
  <attributes>
    <name>ДатаСобытия</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерПопыткиОбработкиПакета</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КлючАналитикиПакетаДанных</name>
    <type>
      <types>CatalogRef.ум_КлючиАналитикиПакетовДанных</types>
    </type>
  </attributes>
  <attributes>
    <name>Сообщение</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторРезультатаОбработки</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>ДлительностьОбработки</name>
    <comment>Длительность обработки</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КлючРабочегоПотока</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>ИдентификаторПакета</name>
    <type>
      <types>UUID</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВременнаяМеткаСобытия</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

1c_um/src/InformationRegisters/ум_ПакетыДанныхДанные/ум_ПакетыДанныхДанные.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ум_ПакетыДанныхДанные</name>
  <attributes>
    <name>Данные</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <dimensions>
    <name>ИдентификаторПакета</name>
    <type>
      <types>UUID</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

1c_um/src/InformationRegisters/ум_ЛогФоновыхЗаданийПакетов/ум_ЛогФоновыхЗаданийПакетов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ум_ЛогФоновыхЗаданийПакетов</name>
  <resources>
    <name>Вид</name>
    <type>
      <types>EnumRef.ум_ВидыФЗПакетовДанных</types>
    </type>
  </resources>
  <resources>
    <name>ИдентификаторРодительскогоФЗ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>СпособОбработкиПакетов</name>
    <type>
      <types>CatalogRef.ум_СпособыОбработкиПакетов</types>
    </type>
  </resources>
  <attributes>
    <name>ДанныеСобытия</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <dimensions>
    <name>ИдентификаторФЗ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ВременнаяМеткаСобытия</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Событие</name>
    <type>
      <types>EnumRef.ум_ЛогированиеСобытийФЗ</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

1c_um/src/Enums/ум_ВидыФЗПакетовДанных/ум_ВидыФЗПакетовДанных.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ум_ВидыФЗПакетовДанных</name>
  <enumValues>
    <name>РегламентноеЗаданиеОбработкаПакетов</name>
  </enumValues>
  <enumValues>
    <name>РегламентноеЗаданиеКонтрольРабочихФЗ</name>
  </enumValues>
  <enumValues>
    <name>УпровляющееФЗ</name>
  </enumValues>
  <enumValues>
    <name>РабочееФЗ</name>
  </enumValues>
  <enumValues>
    <name>РегламентноеЗаданиеОбслуживаниеСистемы</name>
  </enumValues>
</mdclass:Enum>

1c_um/src/Enums/ум_СостоянияПакетаДанных/ум_СостоянияПакетаДанных.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ум_СостоянияПакетаДанных</name>
  <enumValues>
    <name>ВОбработке</name>
  </enumValues>
  <enumValues>
    <name>КОбработке</name>
  </enumValues>
  <enumValues>
    <name>Обработан</name>
  </enumValues>
  <enumValues>
    <name>Ошибка</name>
  </enumValues>
</mdclass:Enum>

1c_um/src/Catalogs/ум_КлючиАналитикиПакетовДанных/ум_КлючиАналитикиПакетовДанных.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ум_КлючиАналитикиПакетовДанных</name>
  <attributes>
    <name>СпособОбработкиПакетов</name>
    <type>
      <types>CatalogRef.ум_СпособыОбработкиПакетов</types>
    </type>
  </attributes>
  <attributes>
    <name>СостояниеПакетаДанных</name>
    <type>
      <types>EnumRef.ум_СостоянияПакетаДанных</types>
    </type>
  </attributes>
</mdclass:Catalog>

1c_um/src/Catalogs/ум_СпособыОбработкиПакетов/ум_СпособыОбработкиПакетов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ум_СпособыОбработкиПакетов</name>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>МногопоточноеИзменениеПакетовДанных</name>
      <description>Многопоточное изменение пакетов данных</description>
    </items>
    <items>
      <name>ОчисткаЛоговФЗ</name>
      <description>Очистка логов ФЗ</description>
    </items>
    <items>
      <name>ПакетыДанныхОбслуживание</name>
      <description>Регламентное обслуживание пакетов данных</description>
    </items>
  </predefined>
  <attributes>
    <name>Активность</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяФункции</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИмяДляРазработчика</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяЖизниУправляющегоФЗ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоПакетовНаУправляющееФЗ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоРабочихФЗ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяЖизниРабочегоФЗ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоПакетовНаРабочееФЗ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоПопытокОбработкиПакета</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПовторнаяОбработкаПакетовСОшибками</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТаймаутПовторнойОбработкиПакета</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УдалятьПакетПриУспешнойОбработке</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТаймаутУдаленияПакета</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьОбщийСписокОшибок</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьПроизвольныйКодОбработки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроизвольныйКодОбработки</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ХешСуммаПроизвольногоКодаОбработки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КлючРегламентногоЗадания</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ОшибкиОбработкиПакетов</name>
    <attributes>
      <name>ОписаниеОшбики</name>
      <type>
        <types>CatalogRef.ум_ОписанияОшибокОбработкиПакетов</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

1c_um/src/CommonModules/ум_ПакетыДанныхОбработка/Module.bsl
#Область РегламентноеЗадание_ОбработкаПакетовДанных

// Запускает управляющие фоновые задания для обработки пакетов данных по способам обработки,
// по которым отсутствуют активные управляющие фоновые задания.
//
// Параметры:
//   СпособОбработкиДляЗапуска - СправочникСсылка.ум_СпособыОбработкиПакетов - если указан, будут
//       обработаны пакеты только по этому способу обработки. Если Неопределено - по всем
//       способам, для которых требуется запуск управляющего фонового задания.
Процедура ОбработатьПакетыДанных(СпособОбработкиДляЗапуска = Неопределено) Экспорт
	
	ВидыФЗ = Перечисления.ум_ВидыФЗПакетовДанных.РегламентноеЗаданиеОбработкаПакетов; 
	ИдентификаторТекущегоФЗ = ум_ЛогированиеПакетыДанных.УникальныйИдентификаторТекущегоФЗ();
	ум_ЛогированиеПакетыДанных.ЗаписатьСтарт(ИдентификаторТекущегоФЗ, ВидыФЗ);
	
	// получим способы обработки - кандидаты, по которым нужно запускать управляющее ФЗ
	ВыборкаСпособовОбработкиДляЗапуска = ПолучитьВыборкуСпособовОбработкиПакетовДляЗапуска(СпособОбработкиДляЗапуска);
	
	// Отберем все запущенные управляющие ФЗ
	ИмяМетода = "ум_ПакетыДанныхОбработка.ОбработчикУправляющегоФЗ"; 
	ОтборУправляющихФЗ = Новый Структура("Состояние, ИмяМетода", СостояниеФоновогоЗадания.Активно, ИмяМетода);
	ЗапущенныеУправляющиеФЗ = ФоновыеЗадания.ПолучитьФоновыеЗадания(ОтборУправляющихФЗ); 
	
	СоответствиеКлючИУправляющееФЗ = Новый Соответствие;
	Для каждого ФоновоеЗадание Из ЗапущенныеУправляющиеФЗ Цикл
		// ключ - это уникальный идентификатор способа обработки
		// значение - идентификатор запущенного управляющего ФЗ
		СоответствиеКлючИУправляющееФЗ.Вставить(ФоновоеЗадание.Ключ, ФоновоеЗадание.УникальныйИдентификатор);
	КонецЦикла;
	
	КоличествоЗапущеноФоновых = 0;
	Пока ВыборкаСпособовОбработкиДляЗапуска.Следующий() Цикл    
		
		УИДСпособаОбработки = Строка(ВыборкаСпособовОбработкиДляЗапуска.УникальныйИдентификатор);
		
		Если НЕ СоответствиеКлючИУправляющееФЗ[УИДСпособаОбработки] = Неопределено Тогда
			//уже есть активное управляющее ФЗ для данного способа обработки
			Продолжить;
		КонецЕсли;
		
		// запустим фоновое задание
		ПараметрыЗапускаУправляющегоФЗ = Новый Массив;
		ПараметрыЗапускаУправляющегоФЗ.Добавить(ВыборкаСпособовОбработкиДляЗапуска.СпособОбработки);
		ПараметрыЗапускаУправляющегоФЗ.Добавить(ВыборкаСпособовОбработкиДляЗапуска.КлючАналитикиПакетаДанных);
		ПараметрыЗапускаУправляющегоФЗ.Добавить(ИдентификаторТекущегоФЗ);
		
		КоличествоЗапущеноФоновых = КоличествоЗапущеноФоновых + 1;
		ФоновыеЗадания.Выполнить(ИмяМетода
									, ПараметрыЗапускаУправляющегоФЗ
									, УИДСпособаОбработки
									, "Управляющее ФЗ: " + ВыборкаСпособовОбработкиДляЗапуска.СпособОбработки);
		
	КонецЦикла;
	
	ДанныеСобытия = Новый Структура("КоличествоЗапущеноФоновых", КоличествоЗапущеноФоновых);
	ум_ЛогированиеПакетыДанных.ЗаписатьОкончание(ИдентификаторТекущегоФЗ, ВидыФЗ,,,ДанныеСобытия);
	
КонецПроцедуры

Функция ПолучитьВыборкуСпособовОбработкиПакетовДляЗапуска(СпособОбработкиДляЗапуска)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДатаСеанса());
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ум_СпособыОбработкиПакетов.Ссылка КАК СпособОбработки,
	|	ум_КлючиАналитикиПакетовДанных.Ссылка КАК КлючАналитикиПакетаДанных,
	|	УНИКАЛЬНЫЙИДЕНТИФИКАТОР(ум_СпособыОбработкиПакетов.Ссылка) КАК УникальныйИдентификатор
	|ИЗ
	|	Справочник.ум_КлючиАналитикиПакетовДанных КАК ум_КлючиАналитикиПакетовДанных
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ум_СпособыОбработкиПакетов КАК ум_СпособыОбработкиПакетов
	|		ПО ум_КлючиАналитикиПакетовДанных.СпособОбработкиПакетов = ум_СпособыОбработкиПакетов.Ссылка
	|			И (ум_КлючиАналитикиПакетовДанных.СостояниеПакетаДанных = ЗНАЧЕНИЕ(Перечисление.ум_СостоянияПакетаДанных.КОбработке))
	|ГДЕ
	|	ум_СпособыОбработкиПакетов.Активность
	|	И НЕ ум_СпособыОбработкиПакетов.ЭтоГруппа
	|	И ИСТИНА В
	|			(ВЫБРАТЬ ПЕРВЫЕ 1
	|				ИСТИНА КАК ЕстьПакет
	|			ИЗ
	|				РегистрСведений.ум_ПакетыДанных КАК ум_ПакетыДанных
	|			ГДЕ
	|				ум_ПакетыДанных.КлючАналитикиПакетаДанных = ум_КлючиАналитикиПакетовДанных.Ссылка
	|				И НЕ ум_ПакетыДанных.ПакетПрипаркован
	|				И ум_ПакетыДанных.ДатаСледующейОбработкиПакета <= &ТекущаяДата)";
	
	Если ЗначениеЗаполнено(СпособОбработкиДляЗапуска) Тогда
		ТекстЗапроса = ТекстЗапроса + "	И ум_СпособыОбработкиПакетов.Ссылка = &СпособОбработки";
		Запрос.УстановитьПараметр("СпособОбработки", СпособОбработкиДляЗапуска);
	КонецЕсли;
	
	ТекущийСеансИнформационнойБазы = ПолучитьТекущийСеансИнформационнойБазы();
	ТекущееФоновоеЗадание = ТекущийСеансИнформационнойБазы.ПолучитьФоновоеЗадание();
	Если ТекущееФоновоеЗадание = Неопределено Или ТекущееФоновоеЗадание.Ключ = Метаданные.РегламентныеЗадания.ум_МногопоточныйКонвейерОбработкаПакетов.Ключ Тогда
		ОтборПоКлючюРегламентногоЗадания = "";
	Иначе
		ОтборПоКлючюРегламентногоЗадания = ТекущееФоновоеЗадание.Ключ;
	КонецЕсли;
	
	ТекстЗапроса = ТекстЗапроса + "	И ум_СпособыОбработкиПакетов.КлючРегламентногоЗадания = &КлючРегламентногоЗадания";
	Запрос.УстановитьПараметр("КлючРегламентногоЗадания", ОтборПоКлючюРегламентногоЗадания);
	
	Запрос.Текст = ТекстЗапроса;
	
	Возврат Запрос.Выполнить().Выбрать();
	
КонецФункции

#КонецОбласти

#Область УправляющееФЗ

// Обработчик управляющего ФЗ
// 
// Параметры:
//  СпособОбработки    - Справочник.ум_СпособыОбработкиПакетов
Процедура ОбработчикУправляющегоФЗ(СпособОбработки, КлючАналитикиПакетаДанных, ИдентификаторРодительскогоФЗ = Неопределено) Экспорт
	
	ПараметрыСпособаОбработки = ум_ПакетыДанныхОбщегоНазначения.ПолучитьПараметрыСпособаОбработки(СпособОбработки);
	
	Если НЕ ПараметрыСпособаОбработки.Активность Тогда
		Возврат;
	КонецЕсли;  
	
	ВидыФЗ = Перечисления.ум_ВидыФЗПакетовДанных.УпровляющееФЗ; 
	ИдентификаторТекущегоФЗ = ум_ЛогированиеПакетыДанных.УникальныйИдентификаторТекущегоФЗ();
	ум_ЛогированиеПакетыДанных.ЗаписатьСтарт(ИдентификаторТекущегоФЗ, ВидыФЗ, ИдентификаторРодительскогоФЗ, СпособОбработки);
	
	// получим пакеты к обработке
	МассивИдентификаторовПакетов = ПолучитьИдентификаторыПакетовДляУправляющегоФЗ(КлючАналитикиПакетаДанных, ПараметрыСпособаОбработки.КоличествоПакетовНаУправляющееФЗ); 
	
	
	// Получим уже запущенные рабочие ФЗ
	ИмяМетода = "ум_ПакетыДанныхОбработка.ОбработчикРабочегоФЗ";
		
	
	// попытаемся запустить обработку пакетов   
	ВремяЗавершенияУправляющегоФЗ = ТекущаяДатаСеанса() + ПараметрыСпособаОбработки.ВремяЖизниУправляющегоФЗ;  
	ВремяРаботыУправляющегоФЗИстекло = (ТекущаяДатаСеанса() >= ВремяЗавершенияУправляющегоФЗ);	
	ВсеПакетыОбработаны = МассивИдентификаторовПакетов.Количество() = 0;
	ТаблицаРабочихФЗ = Неопределено;
	
	КоличествоПоднятыхФоновыхЗаланий = 0;
	Пока Не ВремяРаботыУправляющегоФЗИстекло И Не ВсеПакетыОбработаны Цикл
		
		Если ТаблицаРабочихФЗ = Неопределено Тогда
			ТаблицаРабочихФЗ = ПолучитьТаблицуРабочихФЗ(ПараметрыСпособаОбработки.ИмяСпособаОбработки, ИмяМетода);   
		Иначе			
			АктуализироватьТаблицуРабочихФЗ(ТаблицаРабочихФЗ);
		КонецЕсли;		
     
		КоличествоРабочихФЗкЗапуску = ПараметрыСпособаОбработки.КоличествоРабочихФЗ - ТаблицаРабочихФЗ.Количество();  
		
		Для ИндексФЗ = 1 По КоличествоРабочихФЗкЗапуску Цикл
			
			// наберем нужне количество пакетов для фонового задания
			МассивИдентификаторовПакетовЗадания = Новый Массив;	
			
			КоличествоПакетовНаРабочееФЗ = Мин(ПараметрыСпособаОбработки.КоличествоПакетовНаРабочееФЗ, МассивИдентификаторовПакетов.Количество());
			Для х = 0 По КоличествоПакетовНаРабочееФЗ - 1 Цикл				
				МассивИдентификаторовПакетовЗадания.Добавить(МассивИдентификаторовПакетов[0]);								
				МассивИдентификаторовПакетов.Удалить(0);
			КонецЦикла;									
			
			КлючРабочегоПотока = Строка(Новый УникальныйИдентификатор);
			
			// запустим рабочее ФЗ			
			МассивПараметровРабочегоФЗ = Новый Массив;
			МассивПараметровРабочегоФЗ.Добавить(МассивИдентификаторовПакетовЗадания);				
			МассивПараметровРабочегоФЗ.Добавить(ПараметрыСпособаОбработки);
			МассивПараметровРабочегоФЗ.Добавить(ИдентификаторТекущегоФЗ);
			
			КоличествоПоднятыхФоновыхЗаланий = КоличествоПоднятыхФоновыхЗаланий + 1;
			РабочееФоновоеЗадание = ФоновыеЗадания.Выполнить(ИмяМетода
													, МассивПараметровРабочегоФЗ
													, КлючРабочегоПотока
													, "Рабочее ФЗ: " + ПараметрыСпособаОбработки.ИмяСпособаОбработки);
			
			// запомним идентификатор ФЗ    
			НоваяСтрока = ТаблицаРабочихФЗ.Добавить();
			НоваяСтрока.ДатаНачала						= РабочееФоновоеЗадание.Начало;   			             
			НоваяСтрока.ИдентификаторФоновогоЗадания	= РабочееФоновоеЗадание.УникальныйИдентификатор;   			                                                                              			      				
			
			ВсеПакетыОбработаны = МассивИдентификаторовПакетов.Количество() = 0;
		
			Если ВсеПакетыОбработаны Тогда       
				// пакетов для обработки больше нет
				Прервать;
			КонецЕсли;		
			
		КонецЦикла;
		
		ВремяРаботыУправляющегоФЗИстекло = (ТекущаяДатаСеанса() >= ВремяЗавершенияУправляющегоФЗ);
				
		Если Не ВсеПакетыОбработаны И Не ВремяРаботыУправляющегоФЗИстекло Тогда
			ЖдатьЗавершенияСамогоСтарогоРабочегоФЗ(ТаблицаРабочихФЗ);	
		КонецЕсли;	  
		
	КонецЦикла;
	
	ДанныеСобытия = Новый Структура("КоличествоЗапущеноФоновых", КоличествоПоднятыхФоновыхЗаланий);
	ум_ЛогированиеПакетыДанных.ЗаписатьОкончание(ИдентификаторТекущегоФЗ, ВидыФЗ,ИдентификаторРодительскогоФЗ, СпособОбработки,
	ДанныеСобытия);
	
КонецПроцедуры    

Функция ПолучитьИдентификаторыПакетовДляУправляющегоФЗ(КлючАналитикиПакетаДанных, КоличествоПакетовНаУправляющееФЗ)
	
	// выберем пакеты по этому способу обработки
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ум_ПакетыДанных.ИдентификаторПакета КАК ИдентификаторПакета
	|ИЗ
	|	РегистрСведений.ум_ПакетыДанных КАК ум_ПакетыДанных
	|ГДЕ
	|	ум_ПакетыДанных.КлючАналитикиПакетаДанных = &КлючАналитикиПакетаДанных
	|	И ум_ПакетыДанных.ДатаСледующейОбработкиПакета <= &ТекущаяДатаСеанса
	|	И НЕ ум_ПакетыДанных.ПакетПрипаркован
	|
	|УПОРЯДОЧИТЬ ПО
	|	ум_ПакетыДанных.ВременнаяМеткаСоздания";   	
	
	Если НЕ КоличествоПакетовНаУправляющееФЗ = 0 Тогда    	
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ВЫБРАТЬ", "ВЫБРАТЬ ПЕРВЫЕ " + Формат(КоличествоПакетовНаУправляющееФЗ, "ЧН=0; ЧГ="));    	
	КонецЕсли;	
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("КлючАналитикиПакетаДанных", КлючАналитикиПакетаДанных);
	Запрос.УстановитьПараметр("ТекущаяДатаСеанса", ТекущаяДатаСеанса());
	
	ВыборкаПакетов = Запрос.Выполнить().Выбрать();
	
	// соберем массив пакетов по способу обработки	
	МассивИдентификаторовПакетов = Новый Массив;
	Пока ВыборкаПакетов.Следующий() Цикл   			
		МассивИдентификаторовПакетов.Добавить(ВыборкаПакетов.ИдентификаторПакета);     			
	КонецЦикла;    
	
	Возврат МассивИдентификаторовПакетов;

КонецФункции

Функция ПолучитьТаблицуРабочихФЗ(Знач ИмяСпособаОбработки, Знач ИмяМетода)
	
	ТаблицаРабочихФЗ = Новый ТаблицаЗначений;   	
	ТаблицаРабочихФЗ.Колонки.Добавить("ДатаНачала");
	ТаблицаРабочихФЗ.Колонки.Добавить("ИдентификаторФоновогоЗадания");
	
	ОтборРабочихФЗ = Новый Структура("Состояние, ИмяМетода, Наименование"
									, СостояниеФоновогоЗадания.Активно
									, ИмяМетода
									, "Рабочее ФЗ: " + ИмяСпособаОбработки);
	АктивныеРабочиеФЗ = ФоновыеЗадания.ПолучитьФоновыеЗадания(ОтборРабочихФЗ);
	
	// Первичное заполнение таблицы фоновых заданий 	
	Для каждого ФоновоеЗадание Из АктивныеРабочиеФЗ Цикл 
		НоваяСтрокаТаблицы = ТаблицаРабочихФЗ.Добавить();
		НоваяСтрокаТаблицы.ДатаНачала = ФоновоеЗадание.Начало;
		НоваяСтрокаТаблицы.ИдентификаторФоновогоЗадания	= ФоновоеЗадание.УникальныйИдентификатор; 		
	КонецЦикла;
	
	Возврат ТаблицаРабочихФЗ;
	
КонецФункции   

Процедура АктуализироватьТаблицуРабочихФЗ(ТаблицаРабочихФЗ)
	
	// актуализируем таблицу активных фоновых заданий
	СтрокиСНеактивнымиФоновыми = Новый Массив;
	Для каждого СтрокаФЗ Из ТаблицаРабочихФЗ Цикл 			
		ФоновоеЗадание = ФоновыеЗадания.НайтиПоУникальномуИдентификатору(СтрокаФЗ.ИдентификаторФоновогоЗадания);
		Если ФоновоеЗадание <> Неопределено И Не ФоновоеЗадание.Состояние = СостояниеФоновогоЗадания.Активно Тогда 
			СтрокиСНеактивнымиФоновыми.Добавить(СтрокаФЗ);
		КонецЕсли;	
	КонецЦикла;	 
	
	Для Каждого СтрокаСНеактивнымФоновым Из СтрокиСНеактивнымиФоновыми Цикл
		ТаблицаРабочихФЗ.Удалить(СтрокаСНеактивнымФоновым);	
	КонецЦикла;

КонецПроцедуры

Процедура ЖдатьЗавершенияСамогоСтарогоРабочегоФЗ(ТаблицаРабочихФЗ)
	
	СамоеСтрароеРабочееФЗ = Неопределено;   		
	Для каждого текРабочееФЗ Из ТаблицаРабочихФЗ Цикл
		
		Если СамоеСтрароеРабочееФЗ = Неопределено Тогда
			СамоеСтрароеРабочееФЗ = текРабочееФЗ;
			Продолжить;			
		КонецЕсли;	
		
		Если СамоеСтрароеРабочееФЗ.ДатаНачала > текРабочееФЗ.ДатаНачала Тогда
			СамоеСтрароеРабочееФЗ = текРабочееФЗ;     				
		КонецЕсли;	
		
	КонецЦикла;	
	
	Если СамоеСтрароеРабочееФЗ = Неопределено Тогда 
		Возврат;
	КонецЕсли;   		
	
	СамоеРаннееФоновоеЗадание = ФоновыеЗадания.НайтиПоУникальномуИдентификатору(СамоеСтрароеРабочееФЗ.ИдентификаторФоновогоЗадания);
	Если СамоеРаннееФоновоеЗадание <> Неопределено И СамоеРаннееФоновоеЗадание.Состояние = СостояниеФоновогоЗадания.Активно Тогда
	    СамоеРаннееФоновоеЗадание.ОжидатьЗавершенияВыполнения(1);
	КонецЕсли;  	
	
КонецПроцедуры    

#КонецОбласти
 
#Область РабочееФЗ
 
// Обработчик рабочего ФЗ
// 
// Параметры:
//		МассивИдентификаторов - Массив - содержит массив идентификаторов пакетов
//		ПараметрыСпособаОбработки - Структура - параметры способа обработки пакетов
Процедура ОбработчикРабочегоФЗ(МассивИдентификаторов, ПараметрыСпособаОбработки, ИдентификаторРодительскогоФЗ = "") Экспорт 
	ВидыФЗ = Перечисления.ум_ВидыФЗПакетовДанных.РабочееФЗ; 
	КлючРабочегоПотока = ПолучитьКлючРабочегоФЗ();
	ИдентификаторТекущегоФЗ = ум_ЛогированиеПакетыДанных.УникальныйИдентификаторТекущегоФЗ();
	СпособОбработки = ПараметрыСпособаОбработки.СпособОбработки;
	ум_ЛогированиеПакетыДанных.ЗаписатьСтарт(ИдентификаторТекущегоФЗ, ВидыФЗ, ИдентификаторРодительскогоФЗ, СпособОбработки);
	
	КоличествоВыполненныхПакетов = 0;
	Для каждого ИдентификаторПакета Из МассивИдентификаторов Цикл  
		
		ПолучитьСообщенияПользователю(Истина); //Удаление сообщений пользователя до начала чтения обработки пакета
		
		НаборЗаписей = ПринятьПакетКОбработке(ИдентификаторПакета, ПараметрыСпособаОбработки, КлючРабочегоПотока);
		Если НаборЗаписей = Неопределено  Тогда  
			Продолжить;	// не удачная попытка принять пакет в обработку
		КонецЕсли;
		ЗаписьПакетаДанных = НаборЗаписей[0];
	
		// запомним время начала выполнения для определния длительности обоработки
		ВремяНачалаВыполенияОперации = ТекущаяУниверсальнаяДатаВМиллисекундах();
		
		КоличествоВыполненныхПакетов = КоличествоВыполненныхПакетов + 1;
		РезультатОбработкиПакета = ВыполнитьИсполняемыйКодПакета(ЗаписьПакетаДанных, ПараметрыСпособаОбработки);
		
		Если ТранзакцияАктивна() Тогда
			// Процедура стороннего разработчика завершилась штатно, но транзакцию не закрыла
			ОтменитьТранзакцию();
			
			РезультатОбработкиПакета = Новый Структура("СостояниеПакетаДанных, Сообщение"
														, Перечисления.ум_СостоянияПакетаДанных.Ошибка
														, "Ошибка обработки пакета данных: неожиданная активная транзакция после выполнения процедуры обработки!");
		КонецЕсли;   		
		
		ПроверитьИСкорректироватьРезультатОбработкиПакета(РезультатОбработкиПакета, ЗаписьПакетаДанных, ПараметрыСпособаОбработки);

		// Зафиксируем состояние пакета после завершения его обработки
		ЗаписьПакетаДанных.ДатаОбработкиПакета = ТекущаяДатаСеанса();
		ЗаписьПакетаДанных.ДлительностьОбработки = ТекущаяУниверсальнаяДатаВМиллисекундах() - ВремяНачалаВыполенияОперации;
		КлючиПоСпособуОбработки = ум_ПакетыДанныхПовтИсп.ПолучитьКлючиАналитикиПакетаДанных(ПараметрыСпособаОбработки.СпособОбработки);
		ЗаписьПакетаДанных.КлючАналитикиПакетаДанных = КлючиПоСпособуОбработки.Получить(РезультатОбработкиПакета.СостояниеПакетаДанных);

		НаборЗаписей.Записать(РежимЗамещения.Обновление);
		
		ДанныеРезультатОбработки = Неопределено;
		РезультатОбработкиПакета.Свойство("РезультатОбработки", ДанныеРезультатОбработки);
		ЗаписьВЖурналСобытийПакетовДанных(ЗаписьПакетаДанных, ЗаписьПакетаДанных.КоличествоПопытокОбработки, РезультатОбработкиПакета.Сообщение, ДанныеРезультатОбработки);
		
	КонецЦикла;
	
	ДанныеСобытия = Новый Структура("ОбработаноПакетов", КоличествоВыполненныхПакетов);
	ум_ЛогированиеПакетыДанных.ЗаписатьОкончание(ИдентификаторТекущегоФЗ, ВидыФЗ,ИдентификаторРодительскогоФЗ, СпособОбработки, ДанныеСобытия);
	
КонецПроцедуры

Функция ПолучитьКлючРабочегоФЗ()
	
	Перем КлючРабочегоПотока;
	
	Сеанс = ПолучитьТекущийСеансИнформационнойБазы();
	Если Сеанс.ПолучитьФоновоеЗадание() = Неопределено Тогда // обычный сеанс    
		ИмяПользователя = Сеанс.Пользователь.Имя;
		КлючРабочегоПотока = "Сеанс: " + Формат(НомерСеансаИнформационнойБазы(), "ЧГ=") + "/" + ИмяПользователя;
	Иначе // фоновое задание 
		ФоновоеЗадание = ПолучитьТекущийСеансИнформационнойБазы().ПолучитьФоновоеЗадание();
		КлючРабочегоПотока = ФоновоеЗадание.Ключ;
	КонецЕсли;
	
	Возврат КлючРабочегоПотока;
	
КонецФункции


Функция ПринятьПакетКОбработке(ИдентификаторПакета, ПараметрыСпособаОбработки, КлючРабочегоПотока)
	
	ВремяНачалаВыполенияоперации = ТекущаяУниверсальнаяДатаВМиллисекундах();
	
	// начинаем транзакцию для того, чтоб работали программные блокировки
	НачатьТранзакцию(РежимУправленияБлокировкойДанных.Управляемый);
	
	Попытка
		ум_ПакетыДанныхОбщегоНазначения.УстановитьБлокировкуРегистраПакетов("ум_ПакетыДанных", ИдентификаторПакета);
	Исключение
		// Не удалось заблокировать пакет данных, его уже кто то обрабатывает. Это штатная ситуация, обработку пакета нужно пропустить.
		ОтменитьТранзакцию();
		Возврат Неопределено;
	КонецПопытки;
	
	// Заблокировали пакет, можно прочитать его актуальное состояние
	ИсходныеЗначенияРеквизитовПакета = ЗначенияРеквизитовПакетаДанных(ИдентификаторПакета);
		
	Если НЕ ПроверитьВозможностьОбработкиПакета(ИсходныеЗначенияРеквизитовПакета, ПараметрыСпособаОбработки) Тогда
		// Состояние пакета и режим запуска не позволяют обработать пакет.
		// Это штатная ситуация,от момента выборки пакета до текущего момента кто то смог обработать пакет - пропускаем пакет.
		ОтменитьТранзакцию();
		Возврат Неопределено;
	КонецЕсли;    	
		
	// Пакет может быть взят в обработку, нужно изменить его состояние и записать в журнал событие взятия в работу.
	НаборЗаписей = ПолучитьНаборЗаписьПакетаДанных(ИсходныеЗначенияРеквизитовПакета); 
	ЗаписьПакетаДанных = НаборЗаписей[0];   
	
	// увеличим счетчик попыток обработки пакета, заполним служебные данные пакета
	ЗаписьПакетаДанных.КоличествоПопытокОбработки	= ИсходныеЗначенияРеквизитовПакета.КоличествоПопытокОбработки + 1;
	ЗаписьПакетаДанных.ДатаОбработкиПакета	 		= ТекущаяДатаСеанса();
	ЗаписьПакетаДанных.КлючРабочегоПотока	 		= КлючРабочегоПотока;
	ЗаписьПакетаДанных.ДлительностьОбработки 		= ТекущаяУниверсальнаяДатаВМиллисекундах() - ВремяНачалаВыполенияоперации;
	
	Если НЕ ПараметрыСпособаОбработки.Свойство("ОбработкаПакетаВСеансеКлиента")
		И ЗаписьПакетаДанных.КоличествоПопытокОбработки > ПараметрыСпособаОбработки.КоличествоПопытокОбработкиПакета Тогда
		
		НововеСостояниеПакетаданных = Перечисления.ум_СостоянияПакетаДанных.Ошибка;
		ТекстСообщения = "Превышено максимальное число попыток обработки пакета! Номер попытки: "
							+ ЗаписьПакетаДанных.КоличествоПопытокОбработки 
							+ ", максимальное число попыток: "
							+ ПараметрыСпособаОбработки.КоличествоПопытокОбработкиПакета;
	Иначе 		
		НововеСостояниеПакетаданных = Перечисления.ум_СостоянияПакетаДанных.ВОбработке;  
		ТекстСообщения = "Начало обработки пакета, попытка №" + ЗаписьПакетаДанных.КоличествоПопытокОбработки;
	КонецЕсли;
	
	КлючиПоСпособуОбработки = ум_ПакетыДанныхПовтИсп.ПолучитьКлючиАналитикиПакетаДанных(ПараметрыСпособаОбработки.СпособОбработки);
	ЗаписьПакетаДанных.КлючАналитикиПакетаДанных = КлючиПоСпособуОбработки.Получить(НововеСостояниеПакетаданных);
	
	Попытка
		// запишем пакет в новом состоянии и  событие в журнал
		НаборЗаписей.Записать(РежимЗамещения.Обновление);
		ЗаписьВЖурналСобытийПакетовДанных(ЗаписьПакетаДанных, ЗаписьПакетаДанных.КоличествоПопытокОбработки, ТекстСообщения);
		ЗафиксироватьТранзакцию();
	Исключение
		// ТУДУ - если возникла ошибка здесь - то это НЕ ШТАТНАЯ ситуация
		// ТУДУ проверить, что запись в ЖР будет даже если произошла откат транзакции. Если записи нет - добавить её вручную.
		ОтменитьТранзакцию();
		Возврат Неопределено;
	КонецПопытки;
	
	Если НововеСостояниеПакетаданных = Перечисления.ум_СостоянияПакетаДанных.Ошибка Тогда
		Возврат Неопределено; // Ошибка при попытке взять пракет в работу возникла в связи с ичерпанием количества попыток обработки.
	Иначе
		Возврат НаборЗаписей;
	КонецЕсли;
	
КонецФункции

Функция ПроверитьВозможностьОбработкиПакета(ИсходныеЗначенияРеквизитовПакета, ПараметрыСпособаОбработки)

	// даже принудительно не запускаем обработку пакета если он обрабатывается в данный момент
	Если ИсходныеЗначенияРеквизитовПакета.СостояниеПакетаДанных = Перечисления.ум_СостоянияПакетаДанных.ВОбработке Тогда
		Возврат Ложь;
	КонецЕсли;  
	
	// автоматический запуск возможен только если пакет "к обработке"
	Если НЕ ПараметрыСпособаОбработки.Свойство("ОбработкаПакетаВСеансеКлиента") 
		И НЕ ИсходныеЗначенияРеквизитовПакета.СостояниеПакетаДанных = Перечисления.ум_СостоянияПакетаДанных.КОбработке Тогда			
		Возврат Ложь;
	КонецЕсли;   		
	
	Возврат Истина;
	
КонецФункции  

Функция ЗначенияРеквизитовПакетаДанных(ИдентификаторПакета) Экспорт
	
	ТекстЗапроса = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ум_ПакетыДанных.*,
	|	ум_ПакетыДанных.КлючАналитикиПакетаДанных.СпособОбработкиПакетов КАК СпособОбработкиПакетов,
	|	ум_ПакетыДанных.КлючАналитикиПакетаДанных.СостояниеПакетаДанных КАК СостояниеПакетаДанных
	|ИЗ
	|	РегистрСведений.ум_ПакетыДанных КАК ум_ПакетыДанных
	|ГДЕ
	|	ум_ПакетыДанных.ИдентификаторПакета = &ИдентификаторПакета";
	
	Запрос = Новый Запрос(ТекстЗапроса);	
	Запрос.УстановитьПараметр("ИдентификаторПакета", ИдентификаторПакета);
	
	РезультатЗапроса = Запрос.Выполнить();  
	
	Если РезультатЗапроса.Пустой() Тогда 
		ВызватьИсключение "Не найден пакет данных с идентификатором " + ИдентификаторПакета;  
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();

	Возврат Выборка;

КонецФункции 

Функция ПолучитьНаборЗаписьПакетаДанных(ЗначенияРеквизитовПакета)
	
	НаборЗаписей = РегистрыСведений.ум_ПакетыДанных.СоздатьНаборЗаписей();
	ЗаписьНабора = НаборЗаписей.Добавить();
	ЗаполнитьЗначенияСвойств(ЗаписьНабора, ЗначенияРеквизитовПакета);
	
	Возврат НаборЗаписей;

КонецФункции

Функция ПолучитьИсполняемыйКодОбработкиПакета(ПараметрыСпособаОбработки)
	
	Если ПараметрыСпособаОбработки.ИспользоватьПроизвольныйКодОбработки Тогда
		СтрокаВыполнения = ПараметрыСпособаОбработки.ПроизвольныйКодОбработки;
	Иначе
		СтрокаВыполнения = "РезультатОбработкиПакета = " + ПараметрыСпособаОбработки.ИмяФункции + "(Данные, ПараметрыПакетаДанных, ПараметрыСпособаОбработки)";
	КонецЕсли;
	
	Возврат СтрокаВыполнения;
	
КонецФункции 

Функция ВыполнитьИсполняемыйКодПакета(ЗаписьПакетаДанных, ПараметрыСпособаОбработки)
	
	// Получим исполняемый код пакета и выполним его	
	ИсполняемыйКодОбработкиПакета = ПолучитьИсполняемыйКодОбработкиПакета(ПараметрыСпособаОбработки); 
	
	// Подготовим параметры для функции обработки пакета 
	ПараметрыПакетаДанных = Новый Структура("ДатаСозданияПакета, КодИС, ДополнительнаяИнформация, ИдентификаторПакета, Комментарий");
	ЗаполнитьЗначенияСвойств(ПараметрыПакетаДанных, ЗаписьПакетаДанных);
	Данные = ум_ПакетыДанныхОбщегоНазначения.ПолучитьДанныеПакета(ЗаписьПакетаДанных.ИдентификаторПакета);
	РезультатОбработкиПакета = Неопределено;
	
	Попытка
		Выполнить(ИсполняемыйКодобработкиПакета); 
	Исключение
		
		Если ТранзакцияАктивна() Тогда
			Выполнить("ОтменитьТранзакцию()");
		КонецЕсли;	
		
		ОписаниеОшибки = ОписаниеОшибки();                                     
		
		СообщенияПользователю = ПолучитьСообщенияПользователю();
		ТекстСообщенийПользователю = "";
		Для Каждого СообщениеПользователю Из СообщенияПользователю Цикл
			ТекстСообщенийПользователю = ТекстСообщенийПользователю + СообщениеПользователю.Текст + Символы.ПС;	
		КонецЦикла;	

		ОписаниеОшибки = ОписаниеОшибки + 
				?(ЗначениеЗаполнено(ТекстСообщенийПользователю), Символы.ПС + "Текст сообщений пользователю: " + ТекстСообщенийПользователю	,"");
				
		РезультатОбработкиПакета = Новый Структура("СостояниеПакетаДанных, Сообщение", Перечисления.ум_СостоянияПакетаДанных.Ошибка, ОписаниеОшибки);  
		
	КонецПопытки; 
	
	Возврат РезультатОбработкиПакета;

КонецФункции    

Функция ПроверитьИСкорректироватьРезультатОбработкиПакета(РезультатОбработкиПакета, ЗаписьПакетаДанных, ПараметрыСпособаОбработки)
	
	// Проверим результат обработки и, при необходимости, скорректрируем результат обработки  
	
	// процедура в исполняемом коде вернула неожиданные данные!
	Если НЕ ТипЗнч(РезультатОбработкиПакета) = Тип("Структура") Или 
		НЕ РезультатОбработкиПакета.Свойство("СостояниеПакетаДанных") Или 
		НЕ РезультатОбработкиПакета.Свойство("Сообщение") Тогда	
		
		РезультатОбработкиПакета = Новый Структура("СостояниеПакетаДанных, Сообщение"
													, Перечисления.ум_СостоянияПакетаДанных.Ошибка
													, "Ошибка обработки пакета данных: неожиданный результат процедуры обработки пакета!");			
	КонецЕсли;	    
												
	
	Если ТипЗнч(РезультатОбработкиПакета.СостояниеПакетаДанных) <> Тип("ПеречислениеСсылка.ум_СостоянияПакетаДанных") ИЛИ
		НЕ ЗначениеЗаполнено(РезультатОбработкиПакета.СостояниеПакетаДанных) ИЛИ
		РезультатОбработкиПакета.СостояниеПакетаДанных = Перечисления.ум_СостоянияПакетаДанных.ВОбработке Тогда    
		
		// Состояние пакета после обработки не корректен 		
		РезультатОбработкиПакета = Новый Структура("СостояниеПакетаДанных, Сообщение"
													, Перечисления.ум_СостоянияПакетаДанных.Ошибка
													, "Ошибка обработки пакета данных: неожиданное состояние пакета данных в результате обработки пакета!");				
	КонецЕсли;        											
	
	// если завершилось с ошибками - проверим, возможно нужно отправить пакет на повторную обработку
	Если РезультатОбработкиПакета.СостояниеПакетаДанных = Перечисления.ум_СостоянияПакетаДанных.Ошибка И 			
		ПараметрыСпособаОбработки.ПовторнаяОбработкаПакетовСОшибками Тогда
		
		СписокПропускаемыхОшибок = ПараметрыСпособаОбработки.СписокПропускаемыхОшибок;
		Для каждого ТекстОшибки Из СписокПропускаемыхОшибок Цикл    
			
			Если НЕ ум_ОбщегоНазначенияКлиентСервер.СтрНайти82(РезультатОбработкиПакета.Сообщение, ТекстОшибки) = 0 Тогда									
				
				РезультатОбработкиПакета = Новый Структура("СостояниеПакетаДанных, Сообщение"
																, Перечисления.ум_СостоянияПакетаДанных.КОбработке
																, "Ошибка обработки пакета находится в списке отправляемых на повторную обработку!" 
																+ Символы.ПС 
																+ РезультатОбработкиПакета.Сообщение);
				Прервать;
			КонецЕсли;   			
		КонецЦикла;   			
	КонецЕсли;      
	
	// если пакет остался в статусе "К обработке", то учтем таймаут повторной обработки из настроек способа обработк
	Если РезультатОбработкиПакета.СостояниеПакетаДанных = Перечисления.ум_СостоянияПакетаДанных.КОбработке Тогда
		Если ПараметрыСпособаОбработки.ТаймаутПовторнойОбработкиПакета = 0 Тогда
			ЗаписьПакетаДанных.ДатаСледующейОбработкиПакета = Неопределено;	
		Иначе
			ЗаписьПакетаДанных.ДатаСледующейОбработкиПакета = ТекущаяДатаСеанса() + ПараметрыСпособаОбработки.ТаймаутПовторнойОбработкиПакета;
		КонецЕсли; 		
	КонецЕсли;      
	
	Если ПараметрыСпособаОбработки.ИспользоватьПроизвольныйКодОбработки Тогда  				
		ДополнениеСообщения = "Пакет обработан произвольным кодом. Хеш кода: " + ПараметрыСпособаОбработки.ХешСуммаПроизвольногоКодаОбработки;
		РезультатОбработкиПакета.Сообщение = РезультатОбработкиПакета.Сообщение + Символы.ПС + ДополнениеСообщения;
	КонецЕсли;    
	
КонецФункции

Процедура ЗаписьВЖурналСобытийПакетовДанных(ДанныеЗаписиПакетаДанных, НомерПопыткиОбработкиПакета, Сообщение, ДанныеРезультатОбработки = Неопределено)
	
	НужнаТранзакция = Не ТранзакцияАктивна();
	Если НужнаТранзакция Тогда
		НачатьТранзакцию();
	КонецЕсли;
	
	НаборЖурналСобытий = РегистрыСведений.ум_ЖурналСобытийПакетовДанных.СоздатьНаборЗаписей();
	Запись = НаборЖурналСобытий.Добавить();
	
	// Измерения
	Запись.ИдентификаторПакета			= ДанныеЗаписиПакетаДанных.ИдентификаторПакета;
	Запись.ВременнаяМеткаСобытия		= ТекущаяУниверсальнаяДатаВМиллисекундах();
	
	// Реквизиты
	Запись.КлючРабочегоПотока			= ДанныеЗаписиПакетаДанных.КлючРабочегоПотока;
	Запись.ДатаСобытия					= ТекущаяДатаСеанса();
	Запись.НомерПопыткиОбработкиПакета	= НомерПопыткиОбработкиПакета;
	
	Запись.КлючАналитикиПакетаДанных	= ДанныеЗаписиПакетаДанных.КлючАналитикиПакетаДанных;
	
	Запись.Сообщение					= Сообщение;
	Запись.ДлительностьОбработки		= ДанныеЗаписиПакетаДанных.ДлительностьОбработки;
	
	Если НЕ ДанныеРезультатОбработки = Неопределено Тогда
		ИдентификаторРезультатаОбработки = Новый УникальныйИдентификатор; 
		Запись.ИдентификаторРезультатаОбработки = ИдентификаторРезультатаОбработки;
		
		// создадим данные
		ДанныеПакета = РегистрыСведений.ум_ПакетыДанныхДанные.СоздатьМенеджерЗаписи();
		НаборДанныеПакета = РегистрыСведений.ум_ПакетыДанныхДанные.СоздатьНаборЗаписей();
		ДанныеПакета = НаборДанныеПакета.Добавить();
		ДанныеПакета.ИдентификаторПакета	= ИдентификаторРезультатаОбработки;
		ДанныеПакета.Данные 				= Новый ХранилищеЗначения(ДанныеРезультатОбработки, Новый СжатиеДанных(1));
	Иначе
		Запись.ИдентификаторРезультатаОбработки = ум_ПакетыДанныхОбщегоНазначения.ПустойУникальныйИдентификатор();
	КонецЕсли;
	
	НаборЖурналСобытий.Записать(РежимЗамещения.Добавление); // нет смысла перезаписывать существующий набор, т.к. его гарантиованно нет
	Если (Запись.ИдентификаторРезультатаОбработки) <> ум_ПакетыДанныхОбщегоНазначения.ПустойУникальныйИдентификатор() Тогда
		НаборДанныеПакета.Записать(РежимЗамещения.Добавление); // нет смысла перезаписывать существующий набор, т.к. его гарантиованно нет
	КонецЕсли;
	
	Если НужнаТранзакция Тогда
		ЗафиксироватьТранзакцию();
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область КонтрольРабочихФЗ

Процедура ум_МногопоточныйКонвейерКонтрольРабочихФЗ() Экспорт
	
	ВидыФЗ = Перечисления.ум_ВидыФЗПакетовДанных.РегламентноеЗаданиеКонтрольРабочихФЗ;
	ИдентификаторТекущегоФЗ = ум_ЛогированиеПакетыДанных.УникальныйИдентификаторТекущегоФЗ();
	ум_ЛогированиеПакетыДанных.ЗаписатьСтарт(ИдентификаторТекущегоФЗ, ВидыФЗ);
	
	КонтрольЗавершенияФЗЛогирование();
	
	ТаблицаПакетовВОбработке = ТаблицаПакетовВОбработке();
	Для каждого ПакетДанных Из ТаблицаПакетовВОбработке Цикл
	
		ОбработкаВПользовательскомСеансе = (Лев(ПакетДанных.КлючРабочегоПотока, 6) = "Сеанс:");
		Если ОбработкаВПользовательскомСеансе Тогда
			ПроверкаПользовательскогоСеанса(ПакетДанных);
		Иначе
			ПроверкаРабочегоФЗ(ПакетДанных);
		КонецЕсли;
		
	КонецЦикла;   
	
	ум_ЛогированиеПакетыДанных.ЗаписатьОкончание(ИдентификаторТекущегоФЗ, ВидыФЗ);
	
КонецПроцедуры  

Процедура КонтрольЗавершенияФЗЛогирование()     
	
	ПараметрыУдаленияЛоговФЗ = ум_ПакетыДанныхПовтИсп.ПолучитьНастройкиЛогированияФЗ(); 
	Если ПараметрыУдаленияЛоговФЗ.ЛогированиеФЗ = Ложь Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ум_ЛогФоновыхЗаданийПакетовРабочиеФЗ.ИдентификаторФЗ КАК ИдентификаторФЗ,
	|	ум_ЛогФоновыхЗаданийПакетовРабочиеФЗ.СпособОбработкиПакетов КАК СпособОбработки,
	|	ум_ЛогФоновыхЗаданийПакетовРабочиеФЗ.Вид КАК Вид,
	|	ум_ЛогФоновыхЗаданийПакетовРабочиеФЗ.ИдентификаторРодительскогоФЗ КАК ИдентификаторРодительскогоФЗ
	|ПОМЕСТИТЬ вт
	|ИЗ
	|	РегистрСведений.ум_ЛогФоновыхЗаданийПакетов КАК ум_ЛогФоновыхЗаданийПакетовРабочиеФЗ
	|ГДЕ
	|	ум_ЛогФоновыхЗаданийПакетовРабочиеФЗ.Вид = ЗНАЧЕНИЕ(Перечисление.ум_ВидыФЗПакетовДанных.РабочееФЗ)
	|
	|СГРУППИРОВАТЬ ПО
	|	ум_ЛогФоновыхЗаданийПакетовРабочиеФЗ.ИдентификаторФЗ,
	|	ум_ЛогФоновыхЗаданийПакетовРабочиеФЗ.СпособОбработкиПакетов,
	|	ум_ЛогФоновыхЗаданийПакетовРабочиеФЗ.Вид,
	|	ум_ЛогФоновыхЗаданийПакетовРабочиеФЗ.ИдентификаторРодительскогоФЗ
	|
	|ИМЕЮЩИЕ
	|	МИНИМУМ(ум_ЛогФоновыхЗаданийПакетовРабочиеФЗ.ВременнаяМеткаСобытия) = МАКСИМУМ(ум_ЛогФоновыхЗаданийПакетовРабочиеФЗ.ВременнаяМеткаСобытия)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	вт.ИдентификаторФЗ КАК ИдентификаторФЗ,
	|	вт.СпособОбработки КАК СпособОбработки,
	|	вт.Вид КАК Вид,
	|	вт.ИдентификаторРодительскогоФЗ КАК ИдентификаторРодительскогоФЗ,
	|	ЕСТЬNULL(МАКСИМУМ(ум_ЖурналСобытийПакетовДанных.ВременнаяМеткаСобытия), &ТекВремВМилСек) КАК ВременнаяМеткаСобытия
	|ИЗ
	|	вт КАК вт
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ум_ЖурналСобытийПакетовДанных КАК ум_ЖурналСобытийПакетовДанных
	|		ПО ум_ЖурналСобытийПакетовДанных.КлючРабочегоПотока = вт.ИдентификаторФЗ
	|
	|СГРУППИРОВАТЬ ПО
	|	вт.ИдентификаторФЗ,
	|	вт.СпособОбработки,
	|	вт.Вид,
	|	вт.ИдентификаторРодительскогоФЗ";
	
	// Устанавливаем параметр для текущего времени (замените функцию на вашу, если время считается иначе)
	Запрос.УстановитьПараметр("ТекВремВМилСек", ТекущаяУниверсальнаяДатаВМиллисекундах());
	
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		УИДЗадания = Новый УникальныйИдентификатор(ВыборкаДетальныеЗаписи.ИдентификаторФЗ);
		
		ФоновоеЗадание = ФоновыеЗадания.НайтиПоУникальномуИдентификатору(УИДЗадания);
		
		ДанныеСобытия = Новый Структура("Комментарий", "Завершен рег задание КонтрольЗавершенияФЗЛогирование");
		Если ФоновоеЗадание = Неопределено Или ФоновоеЗадание.Состояние <> СостояниеФоновогоЗадания.Активно Тогда
			ум_ЛогированиеПакетыДанных.ЗаписатьОкончание(ВыборкаДетальныеЗаписи.ИдентификаторФЗ,
			ВыборкаДетальныеЗаписи.Вид,
			ВыборкаДетальныеЗаписи.ИдентификаторРодительскогоФЗ,
			ВыборкаДетальныеЗаписи.СпособОбработки,
			ДанныеСобытия,
			ВыборкаДетальныеЗаписи.ВременнаяМеткаСобытия);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

// Получение таблицы рабочих потоков
// 
//Формирование динамического запроса обусловлено тем что при большом количестве пакетов план запроса очень не эфективен
// временный кастыль пока не разберемся в чем дело  
// 
// План с долгим запросом
//  Index Only Scan using _inforg4121_2 on _inforg4121 t1  - не использует отбор по ключу
//
//Merge Join  (cost=16.91..549900.91 rows=6431448 width=17) (actual time=24.351..4017.380 rows=31 loops=1)
//   Merge Cond: (t3._idrref = t1._fld7572rref)
//   ->  Sort  (cost=16.35..16.76 rows=165 width=17) (actual time=0.166..0.216 rows=165 loops=1)
//         Sort Key: t3._idrref
//         Sort Method: quicksort  Memory: 35kB
//         ->  Limit  (cost=0.28..8.62 rows=165 width=17) (actual time=0.019..0.061 rows=165 loops=1)
//               ->  Index Only Scan using _reference7487_4 on _reference7487 t3  (cost=0.28..8.62 rows=165 width=17) (actual time=0.018..0.051 rows=165 loops=1)
//                     Index Cond: (_fld7493rref = '\xae9203328d95e3b74208bc5b362555b1'::bytea)
//                     Heap Fetches: 8
//   ->  Index Only Scan using _inforg4121_2 on _inforg4121 t1  (cost=0.56..469490.63 rows=6431448 width=34) (actual time=0.004..3598.519 rows=6464528 loops=1)
//         Heap Fetches: 1068030
// Planning Time: 0.982 ms
// Execution Time: 4017.422 ms
//
// План с быстрым запросом
//   Index Only Scan using _inforg4121_2 on _inforg4121 t1  (cost=0.56..5859.46 rows=93003 width=34) (actual time=1.413..4.117 rows=0 loops=50)
//         Index Cond: (_fld7572rref = t3._idrref)  - отбор по ключу используется
// 
//Nested Loop  (cost=0.83..339477.95 rows=4650127 width=17) (actual time=26.677..205.945 rows=14 loops=1)
//   ->  Limit  (cost=0.28..2.81 rows=50 width=17) (actual time=0.020..0.045 rows=50 loops=1)
//         ->  Index Only Scan using _reference7487_4 on _reference7487 t3  (cost=0.28..8.62 rows=165 width=17) (actual time=0.020..0.038 rows=50 loops=1)
//               Index Cond: (_fld7493rref = '\xae9203328d95e3b74208bc5b362555b1'::bytea)
//               Heap Fetches: 8
//   ->  Index Only Scan using _inforg4121_2 on _inforg4121 t1  (cost=0.56..5859.46 rows=93003 width=34) (actual time=1.413..4.117 rows=0 loops=50)
//         Index Cond: (_fld7572rref = t3._idrref)
//         Heap Fetches: 3948
// Planning Time: 1.141 ms
// Execution Time: 205.973 ms 
Функция ТаблицаПакетовВОбработке()
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	РазмерПорции = 100;
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ум_КлючиАналитикиПакетовДанных.Ссылка КАК Ссылка,
	|	АВТОНОМЕРЗАПИСИ() КАК АВТОНОМЕРЗАПИСИ
	|ПОМЕСТИТЬ ВТ_Ключи
	|ИЗ
	|	Справочник.ум_КлючиАналитикиПакетовДанных КАК ум_КлючиАналитикиПакетовДанных
	|ГДЕ
	|	ум_КлючиАналитикиПакетовДанных.СостояниеПакетаДанных = &СостояниеПакетаДанных
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	т.Ссылка КАК Ссылка,
	|	ВЫРАЗИТЬ(т.АВТОНОМЕРЗАПИСИ / &РазмерПорции КАК ЧИСЛО(5, 0)) КАК НомерПорции
	|ПОМЕСТИТЬ ВТ_КлючиПоПорциям
	|ИЗ
	|	ВТ_Ключи КАК т
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ_КлючиПоПорциям.НомерПорции КАК НомерПорции
	|ИЗ
	|	ВТ_КлючиПоПорциям КАК ВТ_КлючиПоПорциям
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_Ключи";
	
	// Установка значений параметров
	Запрос.УстановитьПараметр("СостояниеПакетаДанных", Перечисления.ум_СостоянияПакетаДанных.ВОбработке);
	Запрос.УстановитьПараметр("РазмерПорции", РазмерПорции);
	РезультатЗапроса = Запрос.Выполнить();
	
	// соберем запрос
	ТекстЗапросаШаблон =
	"ВЫБРАТЬ
	|	ум_ПакетыДанных.ИдентификаторПакета КАК ИдентификаторПакета,
	|	ум_ПакетыДанных.КлючАналитикиПакетаДанных.СостояниеПакетаДанных КАК Состояние,
	|	ум_ПакетыДанных.КлючРабочегоПотока КАК КлючРабочегоПотока,
	|	ум_ПакетыДанных.КлючАналитикиПакетаДанных.СпособОбработкиПакетов КАК СпособОбработки,
	|	ум_ПакетыДанных.ДлительностьОбработки КАК ДлительностьОбработки,
	|	ум_ПакетыДанных.КлючАналитикиПакетаДанных.СпособОбработкиПакетов.ВремяЖизниРабочегоФЗ КАК МаксВремяЖизниРабочегоФЗ,
	|	ум_ПакетыДанных.КоличествоПопытокОбработки КАК КоличествоПопытокОбработки
	|ИЗ
	|	РегистрСведений.ум_ПакетыДанных КАК ум_ПакетыДанных
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_КлючиПоПорциям КАК вл
	|		ПО (вл.Ссылка = ум_ПакетыДанных.КлючАналитикиПакетаДанных)
	|			И (вл.НомерПорции = &НомерПорции)";
			
	МассивЗапросов = Новый Массив;
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		
		ТекстЗапросаЧасть = СтрЗаменить(ТекстЗапросаШаблон, "&НомерПорции" , Выборка.НомерПорции);
		МассивЗапросов.Добавить(ТекстЗапросаЧасть);
		
	КонецЦикла;
	
	Запрос.Текст = СтрСоединить(МассивЗапросов, " ОБЪЕДИНИТЬ ВСЕ ");
	
	Результат = Запрос.Выполнить().Выгрузить();
	
	Возврат Результат;
	
КонецФункции

Процедура ПроверкаПользовательскогоСеанса(ПакетДанных)
	
	ТекНомерСеанса = ПакетДанных.КлючРабочегоПотока; // "Сеанс: 722/10.04.2017 ИвановИИ" 
	ТекНомерСеанса = Сред(ПакетДанных.КлючРабочегоПотока, 8); // "722/10.04.2017 ИвановИИ"
	ТекНомерСеанса = Лев(ТекНомерСеанса, ум_ОбщегоНазначенияКлиентСервер.СтрНайти82(ТекНомерСеанса, "/") - 1 ); // "722" 
	
	Сеансы = ПолучитьСеансыИнформационнойБазы();
	СеансНайден = Ложь;
	
	Для каждого Сеанс Из Сеансы Цикл
		Если Формат(Сеанс.НомерСеанса, "ЧГ=") = ТекНомерСеанса Тогда
			СеансНайден = Истина;
		КонецЕсли;
	КонецЦикла;
	
	Если Не СеансНайден Тогда
		ТекстСообщения = "Контроль рабочих ФЗ: НЕ НАЙДЕН сеанс пользователя " 
							+ ПакетДанных.КлючРабочегоПотока 
							+ " для пакета данных со статусом ""В обработке""";
		ЗафиксироватьОшибкуКонтроляРабочегоФЗ(ПакетДанных.ИдентификаторПакета, ПакетДанных.КлючРабочегоПотока, ТекстСообщения);
	КонецЕсли;
	
КонецПроцедуры

// ТУДУ - нужно переделать предопределнные элементы ошибок под новый текст
Процедура ПроверкаРабочегоФЗ(ПакетДанных)
	
	РабочееФЗ = Неопределено;
	
	Если ЗначениеЗаполнено(ПакетДанных.КлючРабочегоПотока) Тогда
		МассивРабочихПотоков = ФоновыеЗадания.ПолучитьФоновыеЗадания(Новый Структура("Ключ", ПакетДанных.КлючРабочегоПотока));
		Если НЕ МассивРабочихПотоков.Количество() = 0 Тогда
			РабочееФЗ = МассивРабочихПотоков[0];
		КонецЕсли;    
	КонецЕсли;    		
	
	Если РабочееФЗ = Неопределено Тогда
		
		ТекстСообщения = "Контроль рабочих ФЗ: НЕ НАЙДЕНО рабоче ФЗ """ 
							+ ПакетДанных.КлючРабочегоПотока 
							+ """ для пакета данных со статусом ""В обработке""";
		ЗафиксироватьОшибкуКонтроляРабочегоФЗ(ПакетДанных.ИдентификаторПакета, ПакетДанных.КлючРабочегоПотока, ТекстСообщения);    
		
	ИначеЕсли РабочееФЗ.Состояние = СостояниеФоновогоЗадания.Активно Тогда
		
		Если ПакетДанных.МаксВремяЖизниРабочегоФЗ = 0 Тогда
			// не контролируем время жизни потока
			Возврат;
		КонецЕсли;
		
		ВремяЖизниРабочегоФЗ = ТекущаяДатаСеанса() - РабочееФЗ.Начало;
		
		Если ВремяЖизниРабочегоФЗ < ПакетДанных.МаксВремяЖизниРабочегоФЗ Тогда
			// поток не просрочен
			Возврат;
		КонецЕсли;
		
		// поток просрочен - отменим фоновое задание
		Попытка
			РабочееФЗ.Отменить();
		Исключение
			
			ТекстСообщения = "Контроль рабочих ФЗ: не удалось отменить просроченное рабочее ФЗ " 
								+ ПакетДанных.КлючРабочегоПотока
								+ Символы.ПС
								+ ОписаниеОшибки();
			// не удалось отменить поток - сделаем запись в журнал 
			ЗаписьВЖурналСобытийПакетовДанных(ПакетДанных, ПакетДанных.КоличествоПопытокОбработки, ТекстСообщения);  
			
		КонецПопытки;			
		
		ТекстСообщения = "Контроль рабочих ФЗ: отменено ПРОСРОЧЕННОЕ рабочее ФЗ "
							+ ПакетДанных.КлючРабочегоПотока 
							+ Символы.ПС
							+ "Максимальное время жизни рабочего ФЗ: " 
							+ ПакетДанных.МаксВремяЖизниРабочегоФЗ
							+ Символы.ПС 
							+ "Время жизни рабочего ФЗ: " 
							+ ВремяЖизниРабочегоФЗ;
		ЗафиксироватьОшибкуКонтроляРабочегоФЗ(ПакетДанных.ИдентификаторПакета, ПакетДанных.КлючРабочегоПотока, ТекстСообщения);
		
	ИначеЕсли РабочееФЗ.Состояние = СостояниеФоновогоЗадания.Завершено Тогда
		
		ТекстСообщения = "Контроль рабочих ФЗ: ЗАВЕРШЕНО рабочее ФЗ "
							+ ПакетДанных.КлючРабочегоПотока 
							+ " для пакета данных со статусом ""В обработке""";
		ЗафиксироватьОшибкуКонтроляРабочегоФЗ(ПакетДанных.ИдентификаторПакета, ПакетДанных.КлючРабочегоПотока, ТекстСообщения);
		
	ИначеЕсли РабочееФЗ.Состояние = СостояниеФоновогоЗадания.ЗавершеноАварийно Тогда
		
		ТекстСообщения = "Контроль рабочих ФЗ: ЗАВЕРШЕНО АВАРИЙНО рабочее ФЗ " 
							+ ПакетДанных.КлючРабочегоПотока 
							+ Символы.ПС 
							+ ПолучитьТекстОшибкиИзИнформацииОбОшибке(РабочееФЗ.ИнформацияОбОшибке);
							ЗафиксироватьОшибкуКонтроляРабочегоФЗ(ПакетДанных.ИдентификаторПакета, ПакетДанных.КлючРабочегоПотока, ТекстСообщения);
		
	ИначеЕсли РабочееФЗ.Состояние = СостояниеФоновогоЗадания.Отменено Тогда
		
		ТекстСообщения = 	"Контроль рабочих ФЗ: ОТМЕНЕНО рабочее ФЗ " + ПакетДанных.КлючРабочегоПотока + Символы.ПС +
		ПолучитьТекстОшибкиИзИнформацииОбОшибке(РабочееФЗ.ИнформацияОбОшибке);
		ЗафиксироватьОшибкуКонтроляРабочегоФЗ(ПакетДанных.ИдентификаторПакета, ПакетДанных.КлючРабочегоПотока, ТекстСообщения);  	
	Иначе                   
		
		ТекстСообщения = "";	
		
	КонецЕсли;

КонецПроцедуры    

Процедура ЗафиксироватьОшибкуКонтроляРабочегоФЗ(ИдентификаторПакета, КлючРабочегоПотока, ТекстСообщения)
	Перем НаборЗаписей;
	
	НачатьТранзакцию(РежимУправленияБлокировкойДанных.Управляемый);
	
	Попытка
		ум_ПакетыДанныхОбщегоНазначения.УстановитьБлокировкуРегистраПакетов("ум_ПакетыДанных", ИдентификаторПакета);
	Исключение
		ОтменитьТранзакцию();
		// с рабочим ФЗ мы уже все сделали. Даже если не смогли записать об этом информацию сейчас - следующий запуск контролья всё исправит
		Возврат;
	КонецПопытки;
	
	ЗначенияРеквизитовПакета = ЗначенияРеквизитовПакетаДанных(ИдентификаторПакета);
	
	Если НЕ ЗначенияРеквизитовПакета.СостояниеПакетаДанных = Перечисления.ум_СостоянияПакетаДанных.ВОбработке Тогда
		ОтменитьТранзакцию();
		// Пакет уже не в обработке - делать ничего не нужно
		Возврат;
	КонецЕсли;
	
	НаборЗаписей = ПолучитьНаборЗаписьПакетаДанных(ЗначенияРеквизитовПакета); 
	ЗаписьПакетаДанных = НаборЗаписей[0];
	
	ПараметрыСпособаОбработки = ум_ПакетыДанныхОбщегоНазначения.ПолучитьПараметрыСпособаОбработки(ЗначенияРеквизитовПакета.СпособОбработкиПакетов);
	
	// Пакет в обработке - когда запишем его с ошибкой нужно посмотреть, возможно эта ошибка в списке на повторную обработку
	РезультатОбработкиПакета = Новый Структура("СостояниеПакетаДанных, Сообщение", Перечисления.ум_СостоянияПакетаДанных.Ошибка, ТекстСообщения);
	
	ПроверитьИСкорректироватьРезультатОбработкиПакета(РезультатОбработкиПакета, ЗаписьПакетаДанных, ПараметрыСпособаОбработки);
	
	// Зафиксируем состояние пакета после завершения его обработки
	ЗаписьПакетаДанных.ДатаОбработкиПакета = ТекущаяДатаСеанса();
	
	КлючиПоСпособуОбработки = ум_ПакетыДанныхПовтИсп.ПолучитьКлючиАналитикиПакетаДанных(ПараметрыСпособаОбработки.СпособОбработки);
	ЗаписьПакетаДанных.КлючАналитикиПакетаДанных = КлючиПоСпособуОбработки.Получить(РезультатОбработкиПакета.СостояниеПакетаДанных);
	
	ДанныеРезультатОбработки = Неопределено;
	РезультатОбработкиПакета.Свойство("РезультатОбработки", ДанныеРезультатОбработки);
	
	Попытка
		ЗаписьВЖурналСобытийПакетовДанных(ЗаписьПакетаДанных, ЗаписьПакетаДанных.КоличествоПопытокОбработки, РезультатОбработкиПакета.Сообщение, ДанныеРезультатОбработки);
		НаборЗаписей.Записать(РежимЗамещения.Обновление);
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		// с рабочим ФЗ мы уже все сделали. Даже если не смогли записать об этом информацию сейчас - следующий запуск контролья всё исправит  
		Возврат;
	КонецПопытки;
	
КонецПроцедуры

Функция ПолучитьТекстОшибкиИзИнформацииОбОшибке(ИнформацияОбОшибке)
	
	Если ИнформацияОбОшибке = Неопределено Тогда 
		Возврат "";
	КонецЕсли;
	
	ТекстОписания = "";
	
	Если ЗначениеЗаполнено(ИнформацияОбОшибке.Описание) Тогда
		ТекстОписания = ТекстОписания + "Описание: " + ИнформацияОбОшибке.Описание + Символы.ПС;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ИнформацияОбОшибке.ИмяМодуля) Тогда
		ТекстОписания = ТекстОписания + "Имя модуля: " + ИнформацияОбОшибке.ИмяМодуля + Символы.ПС;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ИнформацияОбОшибке.НомерСтроки) Тогда
		ТекстОписания = ТекстОписания + "Номер строки: " + ИнформацияОбОшибке.НомерСтроки + Символы.ПС;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ИнформацияОбОшибке.ИсходнаяСтрока) Тогда
		ТекстОписания = ТекстОписания + "Исходная строка: " + ИнформацияОбОшибке.ИсходнаяСтрока + Символы.ПС;
	КонецЕсли;
	
	Возврат ТекстОписания;	
	
КонецФункции   

#КонецОбласти
